# System
base
base-devel
linux
linux-headers
linux-firmware
efibootmgr
limine
amd-ucode
sudo
man-db

# System utilities & drivers
xf86-video-amdgpu
vulkan-radeon
libva-mesa-driver
mesa
dosfstools
ntfs-3g
plocate
lm_sensors

# Network
networkmanager
openssh
openvpn
curl
wget

# Audio
pipewire
pipewire-pulse
wireplumber
pamixer

# Display Manager
gdm

# Hyprland
hyprland
hyprpolkitagent
hyprlock
xdg-desktop-portal-hyprland
waybar
rofi
swww
wl-clipboard
grim
slurp
swappy
cliphist
hyprpicker

# Fonts
ttf-font-awesome
ttf-jetbrains-mono-nerd
ttf-fira-code
noto-fonts-emoji

# Themes
materia-gtk-theme
papirus-icon-theme
nwg-look

# Terminal и shell-utilities
kitty
nano
git
starship
zoxide
fastfetch
btop
nnn
iniparser

# Development
nodejs
npm
docker
docker-compose

# Multimedia
gst-libav
vlc
pavucontrol

# User apps
firefox
nautilus
loupe
gnome-calculator
mousepad
baobab
filezilla
libreoffice-still
spotify-launcher
corectrl

# OCR
tesseract
tesseract-data-eng
tesseract-data-rus

# Other utilities
reflector